Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ПубликацииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПубликацииВебКабинетаСУ</name>
  <attributes>
    <name>АдресВебСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацийРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКабинета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКартинок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛоготипа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПользовательУказанВПубликацииИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНовостиСтарее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаПользователи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭлектронныхКурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСвободнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноВосстановлениеПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыВосстановленияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСтандартнаяАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияCAS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервисаCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенСписокОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенКалендарьОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытоеОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныРезультатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныСертификатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтатусОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаКарточкаОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалендаря</name>
    <type>
      <types>EnumRef.ВариантыКалендаряВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлементыБиблиотекиВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоличествоЭлементовРазделаБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРолиПреподавателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайнВМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПинКодыДляРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьАутентификациюПровайдераOpenIDПриВыходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоискПоЭлектроннымРесурсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенРазделПроверкиЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижнийКолонтитул</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйКаталогПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЕдинственнаяПубликацияВОбщемКаталоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>EnumRef.РедакцииВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикЯндексМетрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСервисаSentry</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСведенияВКонсоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеЧислоМинутНеактивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПинКодыНаГлавнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаСбораСтатистики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецЗаполненияПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазместитьСсылкуРегистрацииСверху</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьФотографиюПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьНастройкиРассылокВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаОтзывОтветаНаЗадание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеКомандыПрофиля</name>
    <type>
      <types>EnumRef.ВариантыОформленияКомандыПрофиляВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВКабинете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйСписокОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьПустыеПапкиБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПублично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПослеАвторизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляРегистрации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>EnumRef.ВидыПолейРегистрацииВебКабинетаСУО</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>EnumRef.ТипыПолейРегистрацииВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПолеПодтверждения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодтверждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКакЛогин</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияОтчетовВебКабинетаСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппировкиОбучений</name>
    <attributes>
      <name>Группировка</name>
      <type>
        <types>EnumRef.ГруппировкиОбученийВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_ru</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_en</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ЯзыкиВебКабинетаСУ/ЯзыкиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЯзыкиВебКабинетаСУ</name>
  <enumValues>
    <name>Авто</name>
  </enumValues>
  <enumValues>
    <name>ruRU</name>
  </enumValues>
  <enumValues>
    <name>enEN</name>
  </enumValues>
  <enumValues>
    <name>uaUA</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьОбъектНачальнымиДанными(Объект);
		Объект.Редакция = ВебКабинетСУ.Редакция();
		ЗаполнитьИспользоватьЭлектроннуюПочтуКакЛогин();
		УстановитьФлажокРазрешитьОтзыватьОтветНаЗадание();
		ЗагрузитьТаблицуОтчеты();
	КонецЕсли;	
	
	ЗаполнитьТаблицуГруппировок();
	
	Справочники.ПубликацииВебКабинетаСУ.УстановитьНачальнуюДоступностьЭлементовФормыПубликации(ЭтотОбъект, Элементы);
	
	ИспользуетсяАвтоматическаяНастройка = ВебКабинетСУ.ИспользуетсяАвтоматическаяНастройка(); 
	
	РегистрационныйНомерСформироватьОписание();
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	ИспользоватьПинКодыВПерсональныхНастройках = Константы.ИспользоватьПинКодыВПерсональныхНастройкахСУО.Получить();
	// Удалить реквизит ИспользоватьПинКодыВПерсональныхНастройках
	// Удалить группу элементов СтраницаПинКоды
	//----------------------------------//

	// Формируем выбор языков
	
	МассивДоступныхЯзыков = Новый Массив;
	
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		МассивДоступныхЯзыков.Добавить(Перечисления.ЯзыкиВебКабинетаСУ.Авто);
	КонецЕсли;
	
	МассивДоступныхЯзыков.Добавить(Перечисления.ЯзыкиВебКабинетаСУ.ruRU);
	МассивДоступныхЯзыков.Добавить(Перечисления.ЯзыкиВебКабинетаСУ.enEN);	
	
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		МассивДоступныхЯзыков.Добавить(Перечисления.ЯзыкиВебКабинетаСУ.uaUA);
	КонецЕсли;
	
	МассивПараметровВыбораЯзыка = Новый Массив;
	МассивПараметровВыбораЯзыка.Добавить(
		Новый ПараметрВыбора("ДоступныеЗначения", Новый ФиксированныйМассив(МассивДоступныхЯзыков)));
	
	Элементы.Язык.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбораЯзыка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаПРО Из ТекущийОбъект.ПоляРегистрации Цикл
		Если СтрокаПРО.КонтактнаяИнформация = Справочники.ВидыКонтактнойИнформации.EmailПользователя Тогда
			СтрокаПРО.ИспользоватьКакЛогин = ИспользоватьЭлектроннуюПочтуКакЛогин;		 
		Иначе
			СтрокаПРО.ИспользоватьКакЛогин = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ РазрешитьОтзыватьОтветНаЗадание Тогда
		Объект.ВремяНаОтзывОтветаНаЗадание = 0;
	КонецЕсли;	
	
	ЗаполнитьТабличнуюЧастьРазмещениеОтчетов(ТекущийОбъект, Объект.ДоступенПолныйСписокОтчетов);
	
	Если ТекущийОбъект.ПодключитьОтчеты Тогда
		
		Если ТекущийОбъект.РазмещениеОтчетов.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите хотя бы один отчет для размещения или отключите отчеты'"),,,"РазмещениеОтчетов",Отказ);	
		КонецЕсли;
		
		Если НЕ ТекущийОбъект.ДоступноОткрытиеОтчетаВФорматеPDF		
			И НЕ ТекущийОбъект.ДоступноОткрытиеОтчетаВФорматеExcel
			И НЕ ТекущийОбъект.ДоступноОткрытиеОтчетаВКабинете Тогда
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите хотя бы один вариант открытия отчета или отключите отчеты'"),,,"Объект.ДоступноОткрытиеОтчетаВФорматеExcel",Отказ);			
			
		КонецЕсли;		
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЗаписатьФайлНастроек();
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	Константы.ИспользоватьПинКодыВПерсональныхНастройкахСУО.Установить(ИспользоватьПинКодыВПерсональныхНастройках);
	//----------------------------------//
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	Если НЕ ИспользуетсяАвтоматическаяНастройка Тогда		
		ДанныеФайлаНастроек = СформироватьФайлНастроек();		
		Если ЗначениеЗаполнено(ДанныеФайлаНастроек.АдресФайла) Тогда
			ПолучитьФайл(ДанныеФайлаНастроек.АдресФайла, ДанныеФайлаНастроек.ИмяФайла, Истина);
		КонецЕсли;		
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьИспользоватьЭлектроннуюПочтуКакЛогин();
	УстановитьФлажокРазрешитьОтзыватьОтветНаЗадание();
	ЗагрузитьТаблицуОтчеты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЯзыкПриИзменении(Элемент)
	
	Если Объект.Язык = ПредопределенноеЗначение("Перечисление.ЯзыкиВебКабинетаСУ.Авто") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Редакция = ПредопределенноеЗначение("Перечисление.РедакцииВебКабинетаСУ.Редакция20") Тогда		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ЯзыкПриИзмененииПродолжение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить разделы значениями по умолчанию для выбранного языка?'"), Режим, 0);
	Иначе
		ЯзыкПриИзмененииПродолжение(КодВозвратаДиалога.Нет, Неопределено)
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЯзыкПриИзмененииПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьРазделыПоУмолчаниюНаСервере();
    КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ЯзыкПриИзмененииПродолжение2", ЭтаФорма);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить поля регистрации значениями по умолчанию для выбранного языка?'"), Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯзыкПриИзмененииПродолжение2(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоляРегистрацииПоУмолчаниюНаСервере();
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	РегистрационныйНомерСформироватьОписание();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПинКодыВПерсональныхНастройкахПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоляРегистрацииИспользоватьКакЛогинПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступнаСвободнаяРегистрацияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭлектроннуюПочтуКакЛогинПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьОтзыватьОтветНаЗаданиеПриИзменении(Элемент)
	Если НЕ РазрешитьОтзыватьОтветНаЗадание Тогда
		Объект.ВремяНаОтзывОтветаНаЗадание = 0;
	Иначе
		Объект.ВремяНаОтзывОтветаНаЗадание = 30;
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНаОтзывОтветаНаЗаданиеПриИзменении(Элемент)
	Если Объект.ВремяНаОтзывОтветаНаЗадание = 0 Тогда
		РазрешитьОтзыватьОтветНаЗадание = Ложь;
	Иначе
		РазрешитьОтзыватьОтветНаЗадание = Истина;
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОтчетыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступенПолныйСписокОтчетовПриИзменении(Элемент)
	ЗаполнитьТабличнуюЧастьРазмещениеОтчетовПриИзмененииВидаСписка();
	УстановитьДоступностьЭлементовФормы();
	ЗагрузитьТаблицуОтчеты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляРегистрации

&НаКлиенте
Процедура ПоляРегистрацииПриИзменении(Элемент)
	Если НЕ ЕстьСтрокаЭлектроннаяПочтаФормыРегистрации() Тогда
		ИспользоватьЭлектроннуюПочтуКакЛогин = Ложь;
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьРазделыПоУмолчанию(Команда)
	ЗаполнитьРазделыПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляРегистрацииПоУмолчанию(Команда)
	ЗаполнитьПоляРегистрацииПоУмолчаниюНаСервере();
	УстановитьДоступностьЭлементовФормы();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступноОткрытиеОтчетаВФорматеExcelПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступноОткрытиеОтчетаВФорматеPDFПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступноОткрытиеОтчетаВКабинетеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ТекущиеДанные = Элементы.РазмещениеОтчетов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, КлючВарианта", Истина, ТекущиеДанные.КлючВарианта);
	ИмяФормыОтчета = "Отчет."+ТекущиеДанные.ИмяОтчета+".Форма";
	ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартноеНаименование(Команда)
	
	ТекущиеДанные = Элементы.РазмещениеОтчетов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Наименование = ТекущиеДанные.НаименованиеВарианта;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//	
	Если ИспользоватьПинКодыВПерсональныхНастройках Тогда
		Элементы.ИспользоватьПинКодыДляРегистрации.Доступность = Истина;
		Элементы.ПоказатьПинКодыНаГлавнойСтранице.Доступность = Истина;
	Иначе
		Объект.ИспользоватьПинКодыДляРегистрации = Ложь;
		Объект.ПоказатьПинКодыНаГлавнойСтранице = Ложь;
		Элементы.ИспользоватьПинКодыДляРегистрации.Доступность = Ложь;
		Элементы.ПоказатьПинКодыНаГлавнойСтранице.Доступность = Ложь;
	КонецЕсли;
	//----------------------------------//
		
	Элементы.ДекорацияАвтоЛогин.Видимость = Объект.ДоступнаСвободнаяРегистрация И НЕ ИспользоватьЭлектроннуюПочтуКакЛогин;
	Элементы.ПоляРегистрации.Доступность = Объект.ДоступнаСвободнаяРегистрация; 
	Элементы.РазместитьСсылкуРегистрацииСверху.Доступность = Объект.ДоступнаСвободнаяРегистрация;
	Элементы.АдресСтраницыРегистрации.Доступность = Объект.ДоступнаСвободнаяРегистрация;	
	Элементы.ИспользоватьЭлектроннуюПочтуКакЛогин.Доступность = Объект.ДоступнаСвободнаяРегистрация И ЕстьСтрокаЭлектроннаяПочтаФормыРегистрации();
	Элементы.ВремяНаОтзывОтветаНаЗадание.Доступность = РазрешитьОтзыватьОтветНаЗадание;	
	
	Элементы.ГруппаПодключитьОтчеты.Видимость = Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы;
	Элементы.ГруппаОтчеты.Видимость = Объект.ПодключитьОтчеты И Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы;
	Элементы.РазмещениеОтчетовРазместить.Видимость = НЕ Объект.ДоступенПолныйСписокОтчетов;
	Элементы.ДекорацияПодключениеОтчетов.Видимость = НЕ Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы;
	Элементы.ДоступенПолныйСписокОтчетов.Видимость = Объект.ПодключитьОтчеты;
	
	Элементы.ОтчетыДоступность.Видимость = Объект.ДоступенПолныйСписокОтчетов;
	Если Объект.ДоступенПолныйСписокОтчетов Тогда
		Элементы.РазмещениеОтчетов.Заголовок = НСтр("ru = 'Полный список отчетов'");
	Иначе
		Элементы.РазмещениеОтчетов.Заголовок = НСтр("ru = 'Рекомендуемые отчеты'");
	КонецЕсли;
	
	Элементы.ГруппировкиОбученийНаименование_ru.Видимость = 
		Объект.Язык = ПредопределенноеЗначение("Перечисление.ЯзыкиВебКабинетаСУ.Авто")
		ИЛИ Объект.Язык = ПредопределенноеЗначение("Перечисление.ЯзыкиВебКабинетаСУ.ruRU");
		
	Элементы.ГруппировкиОбученийНаименование_en.Видимость = 
		Объект.Язык = ПредопределенноеЗначение("Перечисление.ЯзыкиВебКабинетаСУ.Авто")
		ИЛИ Объект.Язык = ПредопределенноеЗначение("Перечисление.ЯзыкиВебКабинетаСУ.enEN");
		
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажокРазрешитьОтзыватьОтветНаЗадание()	
	РазрешитьОтзыватьОтветНаЗадание = ЗначениеЗаполнено(Объект.ВремяНаОтзывОтветаНаЗадание); 	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлНастроек() 
	
	ДанныеФайлаНастроек = Новый Структура("АдресФайла, ИмяФайла");
	
	ДанныеФайлаНастроек.АдресФайла = Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(Объект.Ссылка);	
	ДанныеФайлаНастроек.ИмяФайла = ВебКабинетСУ.ИмяФайлаНастроек();
	
	Возврат ДанныеФайлаНастроек;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазделыПоУмолчаниюНаСервере()
	
	Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьРазделыПоУмолчанию(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляРегистрацииПоУмолчаниюНаСервере()
	
	Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьПоляРегистрацииПоУмолчанию(Объект);
	
КонецПроцедуры

&НаСервере
Процедура РегистрационныйНомерСформироватьОписание()
	
	ОписаниеНомера = ЛицензированиеВебКабинетаСУ.НайтиРегистрационныйНомер(Объект.РегистрационныйНомер);		
	РезультатПроверки = ЛицензированиеВебКабинетаСУ.РезультатПроверкиРегистрационногоНомера(ОписаниеНомера);
	
	Если ЗначениеЗаполнено(РезультатПроверки) Тогда
		ОписаниеРегистрационногоНомера = РезультатПроверки;
	Иначе
		ОписаниеРегистрационногоНомера = ОписаниеНомера.ЛицензионныеОграничения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИспользоватьЭлектроннуюПочтуКакЛогин()
	
	СтрокаПР = СтрокаЭлектроннаяПочтаФормыРегистрации();
	Если СтрокаПР <> Неопределено И СтрокаПР.ИспользоватьКакЛогин Тогда
		ИспользоватьЭлектроннуюПочтуКакЛогин = Истина;
	Иначе
		ИспользоватьЭлектроннуюПочтуКакЛогин = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьСтрокаЭлектроннаяПочтаФормыРегистрации()
	
	НайденнаяСтрока = Неопределено;
	
	Для каждого СтрокаПР Из Объект.ПоляРегистрации Цикл	
		Если СтрокаПР.КонтактнаяИнформация = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя") Тогда
			НайденнаяСтрока = СтрокаПР;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ?(НайденнаяСтрока = Неопределено, Ложь, Истина);
	
КонецФункции

&НаСервере
Функция СтрокаЭлектроннаяПочтаФормыРегистрации()
	
	НайденнаяСтрока = Неопределено;
	
	Для каждого СтрокаПР Из Объект.ПоляРегистрации Цикл	
		Если СтрокаПР.КонтактнаяИнформация = Справочники.ВидыКонтактнойИнформации.EmailПользователя Тогда
			НайденнаяСтрока = СтрокаПР;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

// Отчеты

&НаСервере
Процедура ЗагрузитьТаблицуОтчеты()
	
	// Очищаем дерево
	
	КорневойРаздел = РазмещениеОтчетов.ПолучитьЭлементы();
	КорневойРаздел.Очистить();
	
	// Получаем все варианты отчетов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтчетов.Ссылка КАК Ссылка,
		|	ВариантыОтчетов.Наименование КАК Наименование,
		|	ВариантыОтчетов.Отчет.ПолноеИмя КАК ПолноеИмя,
		|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|ГДЕ
		|	ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ";
	
	ТаблицаВариантовОтчета = Запрос.Выполнить().Выгрузить();
	
	Если Объект.ДоступенПолныйСписокОтчетов Тогда
		
		// Получаем разделы			
		
		МассивРазделов = Новый Массив;
		
		НовыйРаздел = НовоеОписаниеРаздела();
		НовыйРаздел.Наименование = НСтр("ru = 'Организация обучения / Проведение обучения'");
		МассивРазделов.Добавить(НовыйРаздел);
		
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыОбученияОО", Истина, Истина);
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыОбученияСУ", Истина, Истина);
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыОбученияСУО", Истина, Истина);	
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ОценкаКачестваОбученияСУО", Истина, Истина);
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РаботаПреподавателейСУО", Истина, Истина);		
		
		НовыйРаздел = НовоеОписаниеРаздела();
		НовыйРаздел.Наименование = НСтр("ru = 'Учебные материалы / Электронные ресурсы'");
		МассивРазделов.Добавить(НовыйРаздел);
		
		ЕстьПоддержкаСотрудников = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСотрудников(); 
		ЕстьПоддержкаСтудентов = УправлениеОбучениемСУОВызовСервера.ЕстьПоддержкаСтудентов();
		
		Если ЕстьПоддержкаСотрудников И НЕ ЕстьПоддержкаСтудентов Тогда
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыТестированийСУО", Истина, Ложь);
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ОтветыНаВопросыСУО", Истина, Ложь);
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ИспользованиеЭлектронныхРесурсовСУО", Истина, Ложь);
		ИначеЕсли ЕстьПоддержкаСтудентов И НЕ ЕстьПоддержкаСотрудников Тогда
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыТестированийОО", Истина, Ложь);		
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ОтветыНаВопросыОО", Истина, Ложь);
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ИспользованиеЭлектронныхРесурсовОО", Истина, Ложь);
		Иначе
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.РезультатыТестированийСУЗ", Истина, Ложь);
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ОтветыНаВопросыСУЗ", Истина, Ложь);
			ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ИспользованиеЭлектронныхРесурсовСУЗ", Истина, Ложь);
		КонецЕсли;
		
		НовыйРаздел = НовоеОписаниеРаздела();
		НовыйРаздел.Наименование = НСтр("ru = 'Администрирование / Настройки обучения / Мониторинг активности веб-кабинета'");
		МассивРазделов.Добавить(НовыйРаздел);	
		
		ДобавитьОтчетВраздел(НовыйРаздел, "Отчет.ИспользованиеВебКабинетаСУ", Ложь, Истина);	
			
		Для каждого ОписаниеРаздела Из МассивРазделов Цикл
			
			КорневыеЭлементы = РазмещениеОтчетов.ПолучитьЭлементы();
			СтрокаРаздела = КорневыеЭлементы.Добавить();
			СтрокаРаздела.Наименование = ОписаниеРаздела.Наименование;
			СтрокаРаздела.ЭтоГруппа = Истина;
			СтрокаРаздела.Картинка = 1;
			
			ЭлементыРаздела = СтрокаРаздела.ПолучитьЭлементы();
			
			Для каждого ОписаниеОтчета Из ОписаниеРаздела.Отчеты Цикл
				
				ВариантыОтчета = ТаблицаВариантовОтчета.НайтиСтроки(Новый Структура("ПолноеИмя", ОписаниеОтчета.ПолноеИмяОтчета));
				
				Если ВариантыОтчета.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаОтчета = ЭлементыРаздела.Добавить();
				
				Если ЗначениеЗаполнено(ОписаниеОтчета.МетаданныеОтчета.РасширенноеПредставление) Тогда
					СтрокаОтчета.Наименование = ОписаниеОтчета.МетаданныеОтчета.РасширенноеПредставление;
				ИначеЕсли ЗначениеЗаполнено(ОписаниеОтчета.МетаданныеОтчета.Синоним) Тогда
					СтрокаОтчета.Наименование = ОписаниеОтчета.МетаданныеОтчета.Синоним;
				Иначе
					СтрокаОтчета.Наименование = ОписаниеОтчета.ИмяОтчета;
				КонецЕсли;
				
				СтрокаОтчета.ЭтоГруппа = Истина;
				СтрокаОтчета.Картинка = 1;	
				
				ЭлементыОтчета = СтрокаОтчета.ПолучитьЭлементы();
				
				Для каждого ОписаниеВариантаОтчета Из ВариантыОтчета Цикл				
					ДобавитьВариантОтчета(ЭлементыОтчета, ОписаниеОтчета, ОписаниеВариантаОтчета);				
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		
	Иначе
				
		ТаблицаРекомендуемыхОтчетов = Справочники.ПубликацииВебКабинетаСУ.ТаблицаРекомендуемыхОтчетов();			
		РазмещенныеГруппы = Новый Массив;
		
		Для каждого СтрокаТРО Из ТаблицаРекомендуемыхОтчетов Цикл
						
			ИмяОтчета = СтрРазделить(СтрокаТРО.ПолноеИмяОтчета, ".", Ложь)[1];
			МетаданныеОтчета = Метаданные.Отчеты.Найти(ИмяОтчета);
			
			Если МетаданныеОтчета = Неопределено Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отчет %1 не найден'"), ИмяОтчета);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(СтрокаТРО.ПолноеИмяОтчета) Тогда
				Продолжить;
			КонецЕсли;			
			
			Если РазмещенныеГруппы.Найти(СтрокаТРО.НомерГруппы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВариантыОтчета = ТаблицаВариантовОтчета.НайтиСтроки(
				Новый Структура("ПолноеИмя, КлючВарианта", СтрокаТРО.ПолноеИмяОтчета, СтрокаТРО.КлючВарианта));
			
			Если ВариантыОтчета.Количество() = 0 Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Вариант отчета %1 не найден'"), СтрокаТРО.КлючВарианта);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			ОписаниеВариантаОтчета = ВариантыОтчета[0];
			ОписаниеВариантаОтчета.Наименование = СтрокаТРО.НаименованиеВарианта;
			
			ОписаниеОтчета = НовоеОписаниеОтчета(СтрокаТРО.ПолноеИмяОтчета, Ложь, Ложь, СтрокаТРО.ДоступноКРазмещению);
	
			ДобавитьВариантОтчета(КорневойРаздел, ОписаниеОтчета, ОписаниеВариантаОтчета);
			РазмещенныеГруппы.Добавить(СтрокаТРО.НомерГруппы);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьВариантОтчета(ЭлементыДерева, ОписаниеОтчета, ОписаниеВариантаОтчета)

	СтрокаВариантаОтчета = ЭлементыДерева.Добавить();
	
	СтрокаВариантаОтчета.Наименование = СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Наименование", Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ПустаяСсылка());
	
	Если Объект.ДоступенПолныйСписокОтчетов Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаВариантаОтчета.Наименование) И ОписаниеОтчета.ДоступноКРазмещениюВОбученииПреподавателя Тогда
			СтрокаВариантаОтчета.Наименование = СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Наименование", Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВариантаОтчета.Наименование) И ОписаниеОтчета.ДоступноКРазмещениюНаСтраницеПреподавателя Тогда
			СтрокаВариантаОтчета.Наименование = СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Наименование", Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя);
		КонецЕсли;		
	Иначе
		Если НЕ ЗначениеЗаполнено(СтрокаВариантаОтчета.Наименование) Тогда
			СтрокаВариантаОтчета.Наименование = СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Наименование", ОписаниеОтчета.ДоступноКРазмещению);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаВариантаОтчета.Наименование) Тогда
		СтрокаВариантаОтчета.Наименование = ОписаниеВариантаОтчета.Наименование;	
	КонецЕсли;
	
	СтрокаВариантаОтчета.НаименованиеВарианта = ОписаниеВариантаОтчета.Наименование;
	СтрокаВариантаОтчета.ЭтоГруппа = Ложь;
	СтрокаВариантаОтчета.Картинка = 11;
	СтрокаВариантаОтчета.Отчет = ОписаниеВариантаОтчета.Ссылка;
	СтрокаВариантаОтчета.КлючВарианта = ОписаниеВариантаОтчета.КлючВарианта;
	СтрокаВариантаОтчета.ИмяОтчета = ОписаниеОтчета.ИмяОтчета;
	СтрокаВариантаОтчета.ДоступноКРазмещениюВОбученииПреподавателя = ОписаниеОтчета.ДоступноКРазмещениюВОбученииПреподавателя;
	СтрокаВариантаОтчета.ДоступноКРазмещениюНаСтраницеПреподавателя = ОписаниеОтчета.ДоступноКРазмещениюНаСтраницеПреподавателя;
	СтрокаВариантаОтчета.ДоступноКРазмещению = ОписаниеОтчета.ДоступноКРазмещению;
	
	Если Объект.ДоступенПолныйСписокОтчетов Тогда	
		Если СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Размещение", Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя) <> Неопределено Тогда			
			СтрокаВариантаОтчета.РазмещенВОбученииПреподавателя = Истина;
		КонецЕсли;
		Если СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Размещение", Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя) <> Неопределено Тогда
			СтрокаВариантаОтчета.РазмещенНаСтраницеПреподавателя = Истина;
		КонецЕсли;
	Иначе				 
		Если СвойствоРазмещенияОтчета(ОписаниеВариантаОтчета.Ссылка, "Размещение", ОписаниеОтчета.ДоступноКРазмещению) <> Неопределено Тогда
			СтрокаВариантаОтчета.Размещен = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтчетВраздел(Разделы, ПолноеИмяОтчета, ДоступноКРазмещениюВОбученииПреподавателя, ДоступноКРазмещениюНаСтраницеПреподавателя)
			
	Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ПолноеИмяОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОтчета = НовоеОписаниеОтчета(ПолноеИмяОтчета, ДоступноКРазмещениюВОбученииПреподавателя, ДоступноКРазмещениюНаСтраницеПреподавателя, Неопределено);
	
	Разделы.Отчеты.Добавить(ОписаниеОтчета);
	
КонецПроцедуры

&НаСервере
Функция НовоеОписаниеОтчета(ПолноеИмяОтчета, ДоступноКРазмещениюВОбученииПреподавателя, ДоступноКРазмещениюНаСтраницеПреподавателя, ДоступноКРазмещению)

	ИмяОтчета = СтрРазделить(ПолноеИмяОтчета, ".", Ложь)[1];
	МетаданныеОтчета = Метаданные.Отчеты.Найти(ИмяОтчета);
	
	Если МетаданныеОтчета = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отчет %1 не найден'"), ИмяОтчета);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
	ОписаниеОтчета = Новый Структура;
	ОписаниеОтчета.Вставить("ИмяОтчета", ИмяОтчета);
	ОписаниеОтчета.Вставить("ПолноеИмяОтчета", ПолноеИмяОтчета);
	ОписаниеОтчета.Вставить("МетаданныеОтчета", МетаданныеОтчета);
	ОписаниеОтчета.Вставить("МенеджерОтчета", ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОтчета));
	ОписаниеОтчета.Вставить("ДоступноКРазмещениюВОбученииПреподавателя", ДоступноКРазмещениюВОбученииПреподавателя);
	ОписаниеОтчета.Вставить("ДоступноКРазмещениюНаСтраницеПреподавателя", ДоступноКРазмещениюНаСтраницеПреподавателя);
	ОписаниеОтчета.Вставить("ДоступноКРазмещению", ДоступноКРазмещению);
	
	Возврат ОписаниеОтчета;
	
КонецФункции

&НаСервере
Функция СвойствоРазмещенияОтчета(ВариантОтчета, ИмяСвойства, Размещение)
	
	СтруктураПоиска = Новый Структура("Отчет, Размещение", ВариантОтчета, Размещение);
	СтрокиВТЧ = Объект.РазмещениеОтчетов.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиВТЧ.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокиВТЧ[0][ИмяСвойства];
	
КонецФункции

&НаСервере
Функция НовоеОписаниеРаздела()
	
	ОписаниеРаздела = Новый Структура;
	ОписаниеРаздела.Вставить("Наименование", "");
	ОписаниеРаздела.Вставить("Отчеты", Новый Массив);
	
	Возврат ОписаниеРаздела;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРазмещениеОтчетовПриИзмененииВидаСписка()
	
	ЗаполнитьТабличнуюЧастьРазмещениеОтчетов(Объект, НЕ Объект.ДоступенПолныйСписокОтчетов)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРазмещениеОтчетов(ТекущийОбъект, ДоступенПолныйСписокОтчетов)
	
	ТекущийОбъект.РазмещениеОтчетов.Очистить();
	
	ДобавитьВТабличнуюЧастьСтрокиРазмещениеОтчетов(ТекущийОбъект, РазмещениеОтчетов.ПолучитьЭлементы(), ДоступенПолныйСписокОтчетов);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТабличнуюЧастьСтрокиРазмещениеОтчетов(ТекущийОбъект, ТекущиеСтроки, ДоступенПолныйСписокОтчетов)
	
	Для каждого ТекущаяСтрока Из ТекущиеСтроки Цикл
	
		Если ТекущаяСтрока.ЭтоГруппа Тогда
			ДобавитьВТабличнуюЧастьСтрокиРазмещениеОтчетов(ТекущийОбъект, ТекущаяСтрока.ПолучитьЭлементы(), ДоступенПолныйСписокОтчетов);
			Продолжить;			
		КонецЕсли;
		
		Если ДоступенПолныйСписокОтчетов Тогда
				
			Если ТекущаяСтрока.РазмещенНаСтраницеПреподавателя
				ИЛИ ТекущаяСтрока.РазмещенВОбученииПреподавателя
				ИЛИ ТекущаяСтрока.Наименование <> ТекущаяСтрока.НаименованиеВарианта Тогда			
				
				Если ТекущаяСтрока.РазмещенНаСтраницеПреподавателя Тогда
					
					НоваяСтрокаТЧ = ТекущийОбъект.РазмещениеОтчетов.Добавить();
					НоваяСтрокаТЧ.Отчет = ТекущаяСтрока.Отчет;
					Если ТекущаяСтрока.Наименование = ТекущаяСтрока.НаименованиеВарианта Тогда
						НоваяСтрокаТЧ.Наименование = "";
					Иначе
						НоваяСтрокаТЧ.Наименование = ТекущаяСтрока.Наименование;
					КонецЕсли;
					НоваяСтрокаТЧ.Размещение = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя;
					
				КонецЕсли;
				
				Если ТекущаяСтрока.РазмещенВОбученииПреподавателя Тогда
					
					НоваяСтрокаТЧ = ТекущийОбъект.РазмещениеОтчетов.Добавить();
					НоваяСтрокаТЧ.Отчет = ТекущаяСтрока.Отчет;
					Если ТекущаяСтрока.Наименование = ТекущаяСтрока.НаименованиеВарианта Тогда
						НоваяСтрокаТЧ.Наименование = "";
					Иначе
						НоваяСтрокаТЧ.Наименование = ТекущаяСтрока.Наименование;
					КонецЕсли;
					НоваяСтрокаТЧ.Размещение = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя;
					
				КонецЕсли;
				
				Если НЕ ТекущаяСтрока.РазмещенНаСтраницеПреподавателя
					И НЕ ТекущаяСтрока.РазмещенВОбученииПреподавателя Тогда
					
					НоваяСтрокаТЧ = ТекущийОбъект.РазмещениеОтчетов.Добавить();
					НоваяСтрокаТЧ.Отчет = ТекущаяСтрока.Отчет;
					Если ТекущаяСтрока.Наименование = ТекущаяСтрока.НаименованиеВарианта Тогда
						НоваяСтрокаТЧ.Наименование = "";
					Иначе
						НоваяСтрокаТЧ.Наименование = ТекущаяСтрока.Наименование;
					КонецЕсли;
					НоваяСтрокаТЧ.Размещение = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ПустаяСсылка();					
					
				КонецЕсли;
				
			КонецЕсли;
				
		Иначе
			
			Если ТекущаяСтрока.Размещен
				ИЛИ ТекущаяСтрока.Наименование <> ТекущаяСтрока.НаименованиеВарианта Тогда
			
				НоваяСтрокаТЧ = ТекущийОбъект.РазмещениеОтчетов.Добавить();
				НоваяСтрокаТЧ.Отчет = ТекущаяСтрока.Отчет;
				Если ТекущаяСтрока.Наименование = ТекущаяСтрока.НаименованиеВарианта Тогда
					НоваяСтрокаТЧ.Наименование = "";
				Иначе
					НоваяСтрокаТЧ.Наименование = ТекущаяСтрока.Наименование;
				КонецЕсли;
				Если ТекущаяСтрока.Размещен Тогда
					НоваяСтрокаТЧ.Размещение = ТекущаяСтрока.ДоступноКРазмещению;
				Иначе
					НоваяСтрокаТЧ.Размещение = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;	
	
КонецПроцедуры

// Группировки обучений

&НаСервере
Процедура ЗаполнитьТаблицуГруппировок()
	
	НоваяТаблица = Перечисления.ГруппировкиОбученийВебКабинетаСУО.НоваяТаблицаИспользованияГруппировок();
	
	СтрокиДляУдаления = Новый Массив;
	Для каждого СтрокаГО Из Объект.ГруппировкиОбучений Цикл	
		Если НоваяТаблица.Найти(СтрокаГО.Группировка, "Группировка") = Неопределено Тогда
			СтрокиДляУдаления.Добавить(СтрокаГО);
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
		Объект.ГруппировкиОбучений.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	Для каждого СтрокаНТ Из НоваяТаблица Цикл	
		Если Объект.ГруппировкиОбучений.НайтиСтроки(Новый Структура("Группировка", СтрокаНТ.Группировка)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ГруппировкиОбучений.Добавить();
			НоваяСтрока.Группировка = СтрокаНТ.Группировка;
			НоваяСтрока.Использовать = СтрокаНТ.Использовать;
			НоваяСтрока.Наименование_ru = СтрокаНТ.Наименование_ru;
			НоваяСтрока.Наименование_en = СтрокаНТ.Наименование_en;
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
